{
  "@context": "https://schema.org/",
  "@type": "Product",
  "name": "Tortoise Embroidery White Oversized-Tee",
  "image": [
    "https://zfdsrtwjxwzwbrtfgypm.supabase.co/storage/v1/object/sign/productimages/White/aijim-white-01.png?token=eyJraWQiOiJzdG9yYWdlLXVybC1zaWduaW5nLWtleV84Y2JiM2U1ZS1jZTNiLTRkMTctYTlhOC0zZGU5YzViYTRlZTkiLCJhbGciOiJIUzI1NiJ9.eyJ1cmwiOiJwcm9kdWN0aW1hZ2VzL1doaXRlL2FpamltLXdoaXRlLTAxLnBuZyIsImlhdCI6MTc2MzM4NDM5NSwiZXhwIjoxNzk0OTIwMzk1fQ.fd8Fw_Zb97LVPVNAfOKssk28gY_bxZdSIzv4NXtjlxU"
  ],
  "description": "STORY \n\nEmbrace Persistence. Wear Your Success.\nThis classic white oversized T-shirt combines modern comfort with symbolic artistry. The front side features exquisite tortoise embroidery, celebrating the timeless moral—slow and steady wins the race—to inspire resilience, patience, and confidence in every wearer.\n\n\n DETAILS\n\n✔️ 100% Pure Cotton - Crafted from ultra-soft, breathable cotton for premium daily comfort.\n✔️ Oversized Youth Fit - Relaxed, trendy silhouette for a stylish and youthful look.\n✔️ Weight: 240 GSM - Premium, heavy cotton ensuring durability and a luxurious texture.\n✔️ Front-Side Tortoise Embroidery - Skillfully embroidered tortoise design on the front, adding tactile detail and a touch of storytelling.\n✔️ Colour - Solid white base, offering a clean and versatile canvas for the textured embroidery.\n ✔️ Made in India - Expertly crafted under strict quality standards, reflecting local artisans’ skill.\n\n\nArtwork features\n\n- The tortoise, embroidered with fine threads, stands as a symbol of perseverance, patience, and steadfast progress.\n- Blends cultural inspiration with contemporary fashion, making it perfect for those who seek both style and meaning in their wardrobe.\n- The embroidery offers depth, visual interest, and lasting quality.\n\n\nWASH CARE\n\n- Turn inside out and wash with cold water to maintain the embroidery and fabric’s original softness.\n- Use gentle detergents and avoid harsh chemicals to protect intricate embroidery.\n- Iron on the reverse side or with a cloth barrier, never directly over the embroidery.\n\n\nThis white oversized T-shirt with front tortoise embroidery is an ideal choice for those who want to showcase quietly powerful style and motivational symbolism in everyday wear.\n\n\n",
  "sku": "Aijim-white-001",
  "offers": {
    "@type": "Offer",
    "url": "https://aijim.shop/product/details/Aijim-white-001",
    "priceCurrency": "INR",
    "price": 599,
    "availability": "https://schema.org/InStock"
  },
  "review": [
    {
      "@type": "Review",
      "author": "Anonymous",
      "datePublished": "2025-11-19",
      "reviewBody": "This is a great product!",
      "reviewRating": {
        "@type": "Rating",
        "ratingValue": "5",
        "bestRating": "5"
      }
    }
  ],
  "aggregateRating": {
    "@type": "AggregateRating",
    "ratingValue": "5",
    "reviewCount": 1
  }
}